#6. Реализовать функцию int_func(), принимающую слова из маленьких латинских букв и возвращающую их же,
# но с прописной первой буквой. Например, print(int_func(‘text’)) -> Text.

def int_func(keyword):
    mod_key = keyword.title()
    return mod_key

print(int_func('text'))
